{
    "err_404": "Error 404: Page not found",
    "err_404_text": "The page you are looking for does not exist. Please check the URL or go back to the homepage.",
    "err_404_btn": "Go back to homepage",
    "searched_files": "Searched Files",
    "filters_applied": "Filters Applied",
    "filters": "Filters",
    "search_by_name": "Search by printjob name...",
    "date": "Date",
    "tags": "Tags",
    "scale": "Scale",
    "physical": "Physical",
    "file": "File",
    "customer": "Customer",
    "no_customer_selected": "No customer selected",
    "colors": "Colors",
    "color": "Color",
    "no_color_selected": "No color selected",
    "red": "Red",
    "blue": "Blue",
    "green": "Green",
    "purple": "Purple",
    "pink": "Pink",
    "yellow": "Yellow",
    "orange": "Orange",
    "brown": "Brown",
    "grey": "Grey",
    "white": "White",
    "black": "Black",
    "layer_thickness": "Layer Thickness",
    "layer_thickness_range": "Selected layer thickness range",
    "material": "Material",
    "confirm_delete_job": "Are you sure you want to delete the job",
    "delete": "Delete",
    "cancel": "Cancel",
    "order_by": "Order by",
    "name": "Name",
    "username": "Username",
    "admin": "Admin",
    "password": "Password",
    "likes": "Likes",
    "weight": "Weight",
    "del_jobs": "Delete Jobs",
    "project": "Project",
    "no_results": "No results found",
    "no_tags": "No tags to show",
    "job_file": "Job File",
    "job_desc": "Job Description",
    "new_job": "New Job",
    "preview": "Preview",
    "download": "Download",
    "file_details": "File Details",
    "job_info": "Job Info",
    "license": "License",
    "creation_date": "Creation Date",
    "created": "Created",
    "send_comment": "Send Comment",
    "no_comments": "There are no comments",
    "other_jobs": "Other Jobs from",
    "no_jobs": "No available jobs",
    "login": "Log In",
    "login_invalid": "Invalid username, invalid password or user not activated",
    "like_invalid": "You have to be logged in to like a job",
    "comment_invalid": "Please enter a comment.",
    "active": "Active",
    "img_formats": "* Only .jpg, .png and .jpeg accepted",
    "del_img": "Delete Image",
    "name_placeholder": "Project Name...",
    "desc_placeholder": "Project Description...",
    "undefined": "Undefined",
    "private": "Private",
    "sel_tags": "Selected Tags",
    "add_tag": "Add Tag",
    "select_caps": "SELECT",
    "no_tag_matches": "No tags matches your project?",
    "select_customer": "Select Customer",
    "new_customer": "Are you working for a new customer?",
    "suggest_customer": "Suggest a new customer",
    "upload": "Upload",
    "upload_files": "Upload Files",
    "no_files": "No files yet...",
    "your_files": "Your Files",
    "loading": "Loading...",
    "sign_up": "Sign Up",
    "email": "E-mail",
    "Adress": "Adress",
    "edit_users": "Edit Users",
    "decline": "Decline",
    "accept": "Accept",
    "disable": "Disable",
    "tag-name": "Tag name",
    "actions": "Actions",
    "edit-tags": "Edit tags",
    "search-tag": "Search tag...",
    "home": "Home",
    "edit-tags-legend-blue": "Unaccepted tags",
    "edit-tags-legend-white": "Existing tags",
    "edit-customers": "Edit customers",
    "search-customers": "Search customers...",
    "customer-name": "Customer name",
    "instructions": "Instructions",
    "instr_t1": "This website is a 3D file manager. It allows you to upload and download 3D files in a secure and easy way. The website is divided into four main sections:",
    "instr_hp": "Home Page",
    "instr_hp_t1": "The home page is the main page of the website. It shows the print jobs and has a filtering option, with the possibility to filter by",
    "instr_hp_t1_b": "printjob name, date, tags, customer, colors, layer thickness and material.",
    "instr_hp_t2": " It also has the upload button",
    "instr_hp_t3": " for the logged in users. This button will open a popup where the user can upload a 3D job. With the fields:",
    "project_name": "Project Name",
    "project_desc": "Description",
    "privacity": "Privacity",
    "files": "Files",
    "instr_hp_t4": "There are two types of views on the Home Page, the standard view and the filtered view (shown when a filter is applied). Both of them show all the jobs to all the users except the licensed jobs that are only visible to logged in users. In the filtered view, the logged in users will know that a project is licensed because of the",
    "icon": "icon",
    "admin_t1": "As an admin, you can delete any project on the filtered view. You will need to apply one or more filter and then you will see at the top of the page a delete jobs button.",
    "profile": "Profile Page",
    "profile_t1": "This page shows the user's projects. Here, a user can suggest a new tag, a new customer and delete his own jobs.",
    "admin_t2": "As an admin, you will have 3 more buttons.",
    "admin_users": "Users: Here, an admin can activate/desactivate every user from the server. The admin can also make another users as admins or revoke the admin role to a user",
    "admin_tags": "Tags: Here appears the tags suggested from the users and the accepted ones, an admin can accept, decline, disable, enable or delete a tag from the website.",
    "admin_customers": "Customers: Here appears the customers suggested from the users and the accepted ones, an admin can accept, decline, disable, enable or delete a customer from the website.",
    "uploading_files": "Uploading Files",
    "ufiles_t1": "If you want to upload a file, first of all you will have to log in into the page. If you don't have an account, you can also sign up and create an account",
    "note": "NOTE: ",
    "ufiles_t2": "your account needs to be activated by an admin user",
    "ufiles_t3": "If you are logged in, you will see on the main page the upload button that will open a popup with all the fields",
    "deleting_files": "Deleting Files",
    "dfiles_t1": "In your profile page, you will see on the top of the page a 'delete jobs' button and a list with all your personal projects. Here you can delete all your projects at any time.",
    "dwnd_files": "Downloading Jogs & Files",
    "dwnd_t1": "On the main page, you will see the projects. If you click on a project, you will see the details of the project. Here you can download the files of the project. You can download the files one by one or all at once.",
    "tos": "Terms of Service",
    "effective_date": "Effective Date",
    "tos_t1": "Welcome to Mercantec 3D Print Archive. By accessing or using the Website, you agree to comply with and be bound by these Terms of Service. If you do not agree to these Terms, please do not use the Website.",
    "tos_el": "1. Eligibility",
    "tos_el_t1": "1.1 To create an account, you must provide accurate and complete information, including your name, email address, and a secure password.",
    "tos_el_t2": "1.2 Accounts must be approved by an administrator before you can upload content.",
    "tos_el_t3": "1.3 You are responsible for maintaining the confidentiality of your account credentials and for all activities conducted under your account.",
    "tos_ua": "2. User Accounts",
    "tos_ua_t1": "2.1 Only approved accounts may upload content.",
    "tos_ua_t2": "2.2 Accounts that violate these Terms may be suspended or terminated at the sole discretion of the administrator.",
    "tos_usc": "3. Uploading and Sharing Content",
    "tos_usc_t1": "3.1 Users may upload project files in .stl and .3mf formats.",
    "tos_usc_t2": "3.2 By uploading content, you confirm that:",
    "tos_usc_t3": "You own the rights to the content or have permission to share it.",
    "tos_usc_t4": "The content does not infringe any intellectual property rights, violate laws, or contain offensive material.",
    "tos_usc_t5": "3.3 Uploaded content is publicly visible and can be accessed by both logged-in and non-logged-in users.",
    "tos_pa": "4. Prohibited Activities",
    "tos_pa_t1": "By using the Website, you agree not to:",
    "tos_pa_t2": "Upload malicious files or software.",
    "tos_pa_t3": "Deling af ophavsretligt beskyttet eller ulovligt materiale.",
    "tos_pa_t4": "Impersonate other users or entities.",
    "tos_pa_t5": "Attempt to disrupt the Website's functionality.",
    "tos_pa_t6": "Violation of these rules may result in account suspension or permanent ban.",
    "tos_co": "5. Content Ownership",
    "tos_co_t1": "5.1 Du bevarer ejerskabet af alt indhold, du uploader.",
    "tos_co_t2": "5.2 By uploading content, you grant the Website a non-exclusive, worldwide, royalty-free license to display, distribute, and share your content for the purpose of operating the Website.",
    "tos_li": "6. Liability",
    "tos_li_t1": "6.1 The Website is provided 'as is' without warranty of any kind.",
    "tos_li_t2": "6.2 Mercantec 3D Print Archive is not responsible for the accuracy, quality, or legality of user-uploaded content.",
    "tos_li_t3": "6.3 The Website disclaims all liability for damages resulting from the use or inability to use the Website or its content.",
    "tos_priv": "7. Privacity",
    "tos_priv_t1": "7.1 Webstedet indsamler personlige oplysninger (e-mail, navn og adgangskode) til oprettelse og administration af konti.",
    "tos_priv_t2": "7.2 Personal data is handled in compliance with [applicable data protection laws, e.g., GDPR]. For more details, see our Privacy Policy.",
    "tos_ct": "8. Changes to the Terms",
    "tos_ct_t1": "8.1 The Website reserves the right to modify these Terms at any time.",
    "tos_ct_t2": "8.2 Continued use of the Website after changes are made constitutes acceptance of the revised Terms.",
    "tos_gl": "9. Governing Law",
    "tos_gl_t1": "These Terms are governed by and construed in accordance with the laws of Denmark.",
    "tos_cnt": "10. Contact",
    "tos_cnt_t1": "For questions about these Terms, please contact us at:",
    "pp": "Privacy Policy",
    "pp_intro": "1. Introduction",
    "pp_intro_t1": "This Privacy Policy describes how Mercantec 3D Print Archive collects, uses, and shares personal information when you use the Website.",
    "pp_inco": "2. Information Collection",
    "pp_inco_t1": "We collect the following types of personal information:",
    "pp_inco_t2_p1": "Account Information:",
    "pp_inco_t2_p2": "Name, email address, and password provided during account creation.",
    "pp_inco_t3_p1": "Uploaded Content:",
    "pp_inco_t3_p2": "Files and associated metadata uploaded by users.",
    "pp_inco_t4_p1": "Log Data:",
    "pp_inco_t4_p2": "Information such as IP address, browser type, and access times when you visit the site.",
    "pp_uoi": "3. Use of Information",
    "pp_uoi_t1": "Your information is used for the following purposes:",
    "pp_uoi_t2": "To manage user accounts and enable user uploads.",
    "pp_uoi_t3": "To ensure the security and proper functioning of the website.",
    "pp_uoi_t4": "To improve our services based on user interactions.",
    "pp_is": "4. Information Sharing",
    "pp_is_t1": "We do not sell or rent your personal information. We may share your information in the following cases:",
    "pp_is_t2": "With service providers to maintain and improve the website (e.g., hosting providers).",
    "pp_is_t3": "When required by law or legal process.",
    "pp_is_t4": "To protect the rights, property, or safety of our users or the public.",
    "pp_dr": "5. Data Retention",
    "pp_dr_t1": "We retain your personal information only as long as necessary to fulfill the purposes outlined in this Privacy Policy or as required by law.",
    "pp_sec": "6. Security",
    "pp_sec_t1": "We take reasonable measures to protect your personal information from unauthorized access, loss, or misuse. However, no system can be completely secure.",
    "pp_yr": "7. Your Rights",
    "pp_yr_t1": "Depending on your location, you may have the following rights regarding your personal information:",
    "pp_yr_t2": "Access to your personal information.",
    "pp_yr_t3": "Correction of inaccurate or incomplete information.",
    "pp_yr_t4": "Deletion of your personal information, subject to legal and contractual restrictions.",
    "pp_yr_t5": "Restriction of or objection to processing your personal information.",
    "pp_yr_t6": "Data portability.",
    "pp_yr_t7": "To exercise your rights, please contact us at mercantec@example.com.",
    "pp_ck_t1": "The Website uses cookies to improve user experience. By continuing to use the site, you consent to the use of cookies. You can manage cookie settings through your browser.",
    "pp_cp": "9. Children's Privacity",
    "pp_cp_t1": "The Website is not intended for use by individuals under the age of 13. We do not knowingly collect personal information from children.",
    "pp_ctp": "10. Changes to the Policy",
    "pp_ctp_t1": "We may update this Privacy Policy from time to time. Any changes will be posted on this page with an updated 'Effective Date.'",
    "pp_cntct": "11. Contact",
    "pp_cntct_t1": "If you have any questions about this Privacy Policy or our data practices, please contact us at:",
    "policy": "Policy",
    "ck_intro": "1. Introduction",
    "ck_intro_t1": "This Cookie Policy explains what cookies are, how we use them, and your choices regarding their use on Mercantec 3D Print Archive.",
    "ck_intro_t2": "By using the Website, you consent to the use of cookies as described in this policy. Note that the Website will not function properly without the required cookies.",
    "ck_what": "2. What are Cookies?",
    "ck_what_t1": "Cookies are small text files stored on your device by a website. They help the website remember your preferences and improve your user experience.",
    "ck_cwu": "3. Cookies We Use",
    "ck_cwu_t1": "We use the following types of cookies on our website:",
    "ck_cwu_t2": "Language Cookie",
    "ck_cwu_t3": "Maintains your session while logged in.",
    "ck_cwu_t4": "Stores your preferred language.",
    "ck_wwuc": "4. Why We Use Cookies",
    "ck_wwuc_t1": "We use cookies for the following purposes:",
    "ck_wwuc_t2": "Session Management",
    "ck_wwuc_t3": "To ensure you remain logged in and can access restricted features.",
    "ck_wwuc_t4": "Language Preference",
    "ck_wwuc_t5": "To display the website in your preferred language.",
    "ck_wwuc_t6": "5. Managing Cookies",
    "ck_wwuc_t7": "Because these cookies are essential for the website to function, they cannot be disabled through the cookie banner. However, you can manage or delete cookies through your browser settings. Note that doing so will prevent the website from functioning as intended.",
    "ck_wwuc_t8": "Refer to your browser's help documentation to learn how to manage cookies:",
    "ck_wwuc_t9": "Manage",
    "ck_utcp": "6. Updates to This Cookie Policy",
    "ck_utcp_t1": "We may update this Cookie Policy from time to time. Any changes will be posted on this page with an updated 'Effective Date'.",
    "ck_cntct": "7. Contact",
    "ck_cntct_t1": "If you have any questions about this Cookie Policy, please contact us at:",
    "cancel_del_jobs": "Cancel",
    "suggest-tag":"Suggest a new tag",
    "default_file_color": "Default File Color",
    "description":"Description",
    "suggest_new_tag": "Suggest a new tag",
    "suggest_tag": "Suggest a tag",
    "new_tag": "new tag...",
    "suggest_new_customer": "Suggest a new customer",
    "new_customer_name": "new customer name...",
    "new_customer_email": "new customer e-mail...",
    "phone_number": "Phone number",
    "new_customer_phone": "new phone number...",
    "new_customer_description": "new customer description...",
    "suggest_customer_submit": "Suggest customer",
    "search": "Search by project name",
    "delete_jobs": "Delete jobs",
    "project_date": "Project date",
    "rules_signup": "RULES FOR SIGN UP",
    "spacebar": "No spacebar",
    "special_char": "Do not use special characters like:",
    "exception_char": "except for - and _",
    "min_char": "Password must be at least 8 characters long, username at least 3 characters long and maximum 20.",
    "min_layer_thickness": "Min. layer thickness",
    "search_material": "Search by material...",
    "write_comment": "Write a new comment",
    "physical_weight": "Physical Weight",
    "public": "Public",
    "footer_info": "Contact Information",
    "footer_mail": "Mail",
    "footer_phone": "Phone",
    "footer_copy":"2024 Mercantec 3D Print Archive. All rights reserved.",
    "footer_text1": "Learn more about our project in the ",
    "footer_text2": "section",
    "footer_text4": "GitHub repository ",
    "footer_text5": "Help",
    "footer_text6": "About Us",
    "footer_text7": "Check out our ",
    "footer_text8": "You can explore the source code on our ",
    "aboutus": "About Us",
    "aboutus_t1": "This website is a 3D file manager where a (logged in) user can upload print jobs in order to show them to the world. The website is a project requested by Mercantec, a Danish school, and created by a group of Spanish developers. The page will receive constant maintenance from a group of students from Mercantec.",
    "aboutus_mercantec": "About Mercantec",
    "aboutus_merc_miss": "Mercantec's mission",
    "aboutus_merc_miss_t1": "Mercantec is a place where young people are formed, educated and developed, and where adults, companies and organisations evolve and acquire skills.",
    "aboutus_merc_miss_t2": "We invest our students with the energy and desire for lifelong development, both professional and personal.",
    "aboutus_merc_miss_t3": "We make sure that society possesses the necessary expertise in the fields of vocational basic and continuing education.",
    "aboutus_merc_vis": "Mercantec's vision",
    "aboutus_merc_vis_t1": "Mercantec aims to be the market's educational institution of choice for young people and adults when it comes to vocational education courses, vocational high schools and continuing professional development.",
    "aboutus_merc_vis_t2": "It is our objective to refine and expand the range and combination of technical and commercial courses in an attractive and inspirational educational environment.",
    "about_devs": "About Developers Team",
    "about_devs_t1": "This project has been developed by a team of Spanish developers with the aim of enabling the company 'Mercantec' to better manage its system for storing and downloading 3D files, thereby achieving improved record-keeping as well as increased security and efficiency.",
    "important_rules_signup1.1": "Please send an email to", 
    "important_rules_signup1.2":"to stipulate the reason for creating an account.",
    "important_rules_signup2": "Attach the following information to the email to continue creating the account.",
    "important_rules_procedence":"Where are you from",
    "important_rules_reason":"Reason for creating the account",
    "important_rules_more_info":"You can find more contact information in the 'Help' section"

  }
  